[
  "Maar liefst 29 personen kunnen zeggen dat ze ooit in een Omloop zijn gestart.",
  "Editie 2016 was de best bezochte met 11 personen. Editie 2017 de slechtste met 3 personen.",
  "In 2023 ging de Tour De Snor onder de Wuppertaler Schwebebahn door. Hierin werd op 21 juli 1950 het olifantje Tuffi vervoerd. Tuffi raakte echter in paniek en sprong de Schwebebahn uit. Gelukkig bleef hij ongedeerd.",
  "Er zijn in totaal 1827,55 Omloop De Snor kilometers verreden door de jaren heen.",
  "In 2019 zijn tragere deelnemers voor het eerst eerder gestart. Hierdoor zat iedereen aan het einde van de dag rond hetzelfde tijdstip aan het bier! Nadeel is dat ze niet op de groepsfoto van 2019 staan.",
  "Voorafgaand aan de editie van 2014 werden er vrolijke opplak snorretjes, kostenloos door de organisatie verstrekt om het peloton een vrolijk aanzien te geven.",
  "Voor de Jubileum editie van 2022 is de start verschoven naar het mooie Limburgse heuvelland. Dit resulteerde in een meer dan epische tocht. Dat was tot dan toe de enige keer dat de omloop buiten Utrecht of Nijmegen startte.",
  "In 2016 deden er voor de eerste keer vrouwen mee.",
  "Valkenhof Taverne Snookercentrum en Café Biljart Anita zijn prima horecagelegenheden in Arendonk.",
  "Tijdens de meerdaagse omloop van 2023, sliep de helft van het peloton in tot twee keer toe in een hotelkamer waarvan de airco het niet deed. Dit terwijl de temperaturen er niet om logen!",
  "De edities van 2014 en 2020 waren tot op de meter nauwkeurig even lang.",
  "Deelname is altijd kostenloos geweest en de organisatie bestaat volledig uit vrijwilligers die zich belangenloos inzetten!",
  "In 2021 werd het peloton geteisterd door de eikenprocessierups.",
  "Het meest westelijke puntje van Duitsland is tot nu toe slechts één keer aangedaan. Dat was in 2024. Daar is toen ook de groepsfoto genomen.",
  "In 2020 deden er voor het eerst alleen maar personen mee die al eerder De Omloop hadden gereden.          ",
  "Er bestaat geen wielrenfiets die in alle edities is gebruikt.",
  "Lang voor de eerste officiele editie is er in 2008 een mysterieuze \"Editie 0\" gereden. Over deze editie is weinig bekend maar doen de wildste verhalen de ronde. Van deze tocht zijn onlangs nieuwe beelden opgedoken die alles in een nieuw daglicht zetten. De vraag is of de onderste steen ooit boven komt.....",
  "Slechts twee personen hebben alle edities uitgereden.",
  "Editie 2016 heette in de volksmond ook wel \"De Kastelenroute\" omdat er zoveel kastelen langs de route lagen. In 2019 voerde route de deelnemers langs het kasteel in Hernen. Dit kasteel is het enige kasteel in Nederland met overdekte weergangen. Ook 2024 is totaal niet kasteelvrij verlopen.",
  "In 2015 was er bijna een herfst editie georganiseerd. Vanwege allerlei redenen ging die uiteindelijk niet door.",
  "In 2014 werd er gestopt bij Snackbar \"De Ruif\" in Kudelstaart. Wat er precies werd gegeten valt niet meer te achterhalen. Snackbar \"De Ruif\" bestaat inmiddels ook niet meer.",
  "Slechts 3 vrouwen hebben de Omloop ooit uitgereden.",
  "In 2024 ging Tour De Snor langs Kasteel Hoensbroek. De website van dit kasteel heeft een verschrikkelijke cookiebanner en daarom weigeren we de site te bezoeken om een leuk weetje op te zoeken.",
  "Tijdens de omloop van 2023 werden de grenzen wederom verlegd. Deze omloop duurde maar liefst drie dagen en bevatte ruim 2500 hoogtemeters!",
  "De editienamen bestaan pas sinds 2021. Daarvoor werd elke editie slechts met een jaartal aangeduid. Een primitieve praktijk waar je je nu weinig meer bij voor kan stellen.",
  "De Omloop is door Nederland, Duitsland en België gegaan.",
  "Tijdens De Omloop in 2019 werd cafe Het Ottertje in Ottersum aangedaan. Het Ottertje kreeg landelijke bekendheid toen het te zien was in Man Bijt Hond."
]
